In [2]:
import pandas as pd
import numpy as np

C:\Users\YOSSI\AppData\Roaming\Python\Python310\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [3]:
df = pd.DataFrame(

    {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}

)

In [4]:
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [5]:
df[(df.AAA <= 6) & (df.index.isin([0, 2, 4]))]

   AAA  BBB  CCC
0    4   10  100
2    6   30  -30

In [8]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
df.index.isin([0,2,4])

array([ True, False,  True, False])

In [9]:
df = pd.DataFrame(

    {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]},

    index=["foo", "bar", "boo", "kar"],

)

In [10]:
df

     AAA  BBB  CCC
foo    4   10  100
bar    5   20   50
boo    6   30  -30
kar    7   40  -50

In [11]:
df.loc["bar":"kar"]  # Label

     AAA  BBB  CCC
bar    5   20   50
boo    6   30  -30
kar    7   40  -50

In [12]:
df[0:3]

     AAA  BBB  CCC
foo    4   10  100
bar    5   20   50
boo    6   30  -30

In [13]:
df["bar":"kar"]

     AAA  BBB  CCC
bar    5   20   50
boo    6   30  -30
kar    7   40  -50

In [14]:
data = {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}

In [15]:
data

{'AAA': [4, 5, 6, 7], 'BBB': [10, 20, 30, 40], 'CCC': [100, 50, -30, -50]}

In [16]:
df2 = pd.DataFrame(data=data, index=[1, 2, 3, 4])  # Note index starts at 1.

In [19]:
df2.iloc[1:3]  # Position-oriented

   AAA  BBB  CCC
2    5   20   50
3    6   30  -30

In [20]:
df2.loc[1:3]

   AAA  BBB  CCC
1    4   10  100
2    5   20   50
3    6   30  -30

In [21]:
df = pd.DataFrame(

    {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}

)

In [22]:
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [23]:
df[~((df.AAA <= 6) & (df.index.isin([0, 2, 4])))]

   AAA  BBB  CCC
1    5   20   50
3    7   40  -50

In [25]:
df = pd.DataFrame({"AAA": [1, 2, 1, 3], "BBB": [1, 1, 2, 2], "CCC": [2, 1, 3, 1]})

In [26]:
df

   AAA  BBB  CCC
0    1    1    2
1    2    1    1
2    1    2    3
3    3    2    1

In [27]:
source_cols = df.columns  # Or some subset would work too

In [28]:
source_cols

Index(['AAA', 'BBB', 'CCC'], dtype='object')

In [29]:
new_cols = [str(x) + "_cat" for x in source_cols]

In [30]:
new_cols

['AAA_cat', 'BBB_cat', 'CCC_cat']

In [31]:
categories = {1: "Alpha", 2: "Beta", 3: "Charlie"}

In [34]:
categories.get

In [32]:
df[new_cols] = df[source_cols].map(categories.get)

In [33]:
df

   AAA  BBB  CCC  AAA_cat BBB_cat  CCC_cat
0    1    1    2    Alpha   Alpha     Beta
1    2    1    1     Beta   Alpha    Alpha
2    1    2    3    Alpha    Beta  Charlie
3    3    2    1  Charlie    Beta    Alpha

In [57]:
df = pd.DataFrame(

    {"AAA": [1, 1, 1, 2, 2, 2, 3, 3], "BBB": [2, 1, 3, 4, 5, 1, 2, 3]}

)

In [36]:
df

   AAA  BBB
0    1    2
1    1    1
2    1    3
3    2    4
4    2    5
5    2    1
6    3    2
7    3    3

In [37]:
df.loc[df.groupby("AAA")["BBB"].idxmin()]

   AAA  BBB
1    1    1
5    2    1
6    3    2

In [38]:
df.sort_values(by="BBB").groupby("AAA", as_index=False).first()

   AAA  BBB
0    1    1
1    2    1
2    3    2

In [41]:
df.sort_values(by="BBB").groupby("AAA").first()

     BBB
AAA
1      1
2      1
3      2

In [65]:
df = pd.DataFrame(

    {

        "row": [0, 1, 2],

        "One_X": [1.1, 1.1, 1.1],

        "One_Y": [1.2, 1.2, 1.2],

        "Two_X": [1.11, 1.11, 1.11],

        "Two_Y": [1.22, 1.22, 1.22],

    }

)

df

   row  One_X  One_Y  Two_X  Two_Y
0    0    1.1    1.2   1.11   1.22
1    1    1.1    1.2   1.11   1.22
2    2    1.1    1.2   1.11   1.22

In [66]:
df = df.set_index("row")

In [67]:
df

     One_X  One_Y  Two_X  Two_Y
row
0      1.1    1.2   1.11   1.22
1      1.1    1.2   1.11   1.22
2      1.1    1.2   1.11   1.22

In [68]:
df.columns = pd.MultiIndex.from_tuples([tuple(c.split("_")) for c in df.columns])

In [69]:
df

     One        Two
       X    Y     X     Y
row
0    1.1  1.2  1.11  1.22
1    1.1  1.2  1.11  1.22
2    1.1  1.2  1.11  1.22

In [70]:
df.loc[0, "One"]

X    1.1
Y    1.2
Name: 0, dtype: float64

In [71]:
df1 = df.stack(0, future_stack=True)

In [72]:
df1

            X     Y
row
0   One  1.10  1.20
    Two  1.11  1.22
1   One  1.10  1.20
    Two  1.11  1.22
2   One  1.10  1.20
    Two  1.11  1.22

In [73]:
df2 = df.stack(0, future_stack=True).reset_index(1)

In [74]:
df2

    level_1     X     Y
row
0       One  1.10  1.20
0       Two  1.11  1.22
1       One  1.10  1.20
1       Two  1.11  1.22
2       One  1.10  1.20
2       Two  1.11  1.22

In [76]:
df2.columns = ["Sample", "All_X", "All_Y"]

In [77]:
df2

    Sample  All_X  All_Y
row
0      One   1.10   1.20
0      Two   1.11   1.22
1      One   1.10   1.20
1      Two   1.11   1.22
2      One   1.10   1.20
2      Two   1.11   1.22

In [79]:
cols = pd.MultiIndex.from_tuples(

    [(x, y) for x in ["A", "B", "C"] for y in ["O", "I"]]

)
cols

MultiIndex([('A', 'O'),
            ('A', 'I'),
            ('B', 'O'),
            ('B', 'I'),
            ('C', 'O'),
            ('C', 'I')],
           )

In [83]:
df = pd.DataFrame(np.random.randn(2, 6), index=["n", "m"], columns=cols)
df

          A                   B                   C
          O         I         O         I         O         I
n  1.484159 -0.670921  0.885872 -0.885626 -0.214065  0.744394
m -0.836786  1.305883  0.013152  0.310739  0.850121 -0.316568

In [84]:
df1 = df.div(df["C"], level=1)
df1

          A                   B              C
          O         I         O         I    O    I
n -6.933207 -0.901299 -4.138328 -1.189728  1.0  1.0
m -0.984314 -4.125125  0.015470 -0.981585  1.0  1.0

In [85]:
#misalignment
df2 = df.div(df["C"], level=0)
df2

    A       B       C
    O   I   O   I   O   I
n NaN NaN NaN NaN NaN NaN
m NaN NaN NaN NaN NaN NaN

In [88]:
df1['A']

          O         I
n -6.933207 -0.901299
m -0.984314 -4.125125

In [89]:
df1[('A', 'O')]

n   -6.933207
m   -0.984314
Name: (A, O), dtype: float64

In [90]:
df1.loc[:, ('A', 'O')]

n   -6.933207
m   -0.984314
Name: (A, O), dtype: float64

In [91]:
df1.loc["m", ('A', 'O')]

-0.9843140687213755

In [92]:
df1.loc[:, 'A']

          O         I
n -6.933207 -0.901299
m -0.984314 -4.125125

In [93]:
df1.loc["n", 'A']

O   -6.933207
I   -0.901299
Name: n, dtype: float64

In [94]:
df.xs('O', axis=1, level=1)  # Selects all 'O' subcolumns across all top-level columns

          A         B         C
n  1.484159  0.885872 -0.214065
m -0.836786  0.013152  0.850121

In [99]:
df.loc[:, (slice(None), "O")]

          A         B         C
          O         O         O
n  1.484159  0.885872 -0.214065
m -0.836786  0.013152  0.850121

In [107]:
idx = pd.IndexSlice
idx['A':'C', 'O']

(slice('A', 'C', None), 'O')

In [104]:
idx = pd.IndexSlice
df.loc[:, idx['A':'C', 'O']]  # Selects 'O' subcolumns for A and B

          A         B         C
          O         O         O
n  1.484159  0.885872 -0.214065
m -0.836786  0.013152  0.850121

In [113]:
idx = pd.IndexSlice
df.loc[:, (slice('A', 'C'), 'O')]

          A         B         C
          O         O         O
n  1.484159  0.885872 -0.214065
m -0.836786  0.013152  0.850121

In [115]:
coords = [("AA", "one"), ("AA", "six"), ("BB", "one"), ("BB", "two"), ("BB", "six")]
coords

[('AA', 'one'), ('AA', 'six'), ('BB', 'one'), ('BB', 'two'), ('BB', 'six')]

In [116]:
index = pd.MultiIndex.from_tuples(coords)

In [133]:
df = pd.DataFrame([11, 22, 33, 44, 55], index, ["MyData"])
df

        MyData
AA one      11
   six      22
BB one      33
   two      44
   six      55

In [148]:
df.xs("BB", level=0, axis=0)

     MyData
one      33
two      44
six      55

In [150]:
df.xs("six", level=1, axis=0)

    MyData
AA      22
BB      55

In [135]:
#Selecting a single level
result = df.xs('AA')
result

     MyData
one      11
six      22

In [136]:
result = df.xs(('BB', 'two'))
result

MyData    44
Name: (BB, two), dtype: int64

In [137]:
# Select all rows where the second level is 'one'
result = df.xs('one', level=1)
result

    MyData
AA      11
BB      33

In [138]:
result = df.xs('AA', drop_level=False)
result

        MyData
AA one      11
   six      22

In [140]:
# Select all rows from 'AA' to 'BB' (inclusive)
result = df.loc[(slice('AA', 'BB'), slice(None))]
result

        MyData
AA one      11
   six      22
BB one      33
   two      44
   six      55

In [142]:
# If we had multiple columns, we could select a specific one
# For this example, we'll just demonstrate the syntax
result = df.xs('AA')['MyData']
result

one    11
six    22
Name: MyData, dtype: int64

In [144]:
# Select rows where 'MyData' > 30 for the first level 'BB'
result = df.xs('BB')[df.xs('BB')['MyData'] > 30]
result

     MyData
one      33
two      44
six      55

In [152]:
#Slicing a MultiIndex with xs, method #2

import itertools

index = list(itertools.product(["Ada", "Quinn", "Violet"], ["Comp", "Math", "Sci"]))

headr = list(itertools.product(["Exams", "Labs"], ["I", "II"]))

indx = pd.MultiIndex.from_tuples(index, names=["Student", "Course"])

cols = pd.MultiIndex.from_tuples(headr)  # Notice these are un-named

data = [[70 + x + y + (x * y) % 3 for x in range(4)] for y in range(9)]

In [153]:
index

[('Ada', 'Comp'),
 ('Ada', 'Math'),
 ('Ada', 'Sci'),
 ('Quinn', 'Comp'),
 ('Quinn', 'Math'),
 ('Quinn', 'Sci'),
 ('Violet', 'Comp'),
 ('Violet', 'Math'),
 ('Violet', 'Sci')]

In [154]:
headr

[('Exams', 'I'), ('Exams', 'II'), ('Labs', 'I'), ('Labs', 'II')]

In [155]:
indx

MultiIndex([(   'Ada', 'Comp'),
            (   'Ada', 'Math'),
            (   'Ada',  'Sci'),
            ( 'Quinn', 'Comp'),
            ( 'Quinn', 'Math'),
            ( 'Quinn',  'Sci'),
            ('Violet', 'Comp'),
            ('Violet', 'Math'),
            ('Violet',  'Sci')],
           names=['Student', 'Course'])

In [156]:
cols

MultiIndex([('Exams',  'I'),
            ('Exams', 'II'),
            ( 'Labs',  'I'),
            ( 'Labs', 'II')],
           )

In [157]:
data

[[70, 71, 72, 73],
 [71, 73, 75, 74],
 [72, 75, 75, 75],
 [73, 74, 75, 76],
 [74, 76, 78, 77],
 [75, 78, 78, 78],
 [76, 77, 78, 79],
 [77, 79, 81, 80],
 [78, 81, 81, 81]]

In [158]:
df = pd.DataFrame(data, indx, cols)
df

               Exams     Labs
                   I  II    I  II
Student Course
Ada     Comp      70  71   72  73
        Math      71  73   75  74
        Sci       72  75   75  75
Quinn   Comp      73  74   75  76
        Math      74  76   78  77
        Sci       75  78   78  78
Violet  Comp      76  77   78  79
        Math      77  79   81  80
        Sci       78  81   81  81

In [160]:
All = slice(None)
All

slice(None, None, None)

In [161]:
df.loc["Violet"]

       Exams     Labs
           I  II    I  II
Course
Comp      76  77   78  79
Math      77  79   81  80
Sci       78  81   81  81

In [162]:
df.loc[(All, "Math"), All]

               Exams     Labs
                   I  II    I  II
Student Course
Ada     Math      71  73   75  74
Quinn   Math      74  76   78  77
Violet  Math      77  79   81  80

In [163]:
df.loc[(slice("Ada", "Quinn"), "Math"), All]

               Exams     Labs
                   I  II    I  II
Student Course
Ada     Math      71  73   75  74
Quinn   Math      74  76   78  77

In [164]:
df.loc[(All, "Math"), ("Exams")]

                 I  II
Student Course
Ada     Math    71  73
Quinn   Math    74  76
Violet  Math    77  79

In [165]:
df.loc[(All, "Math"), (All, "II")]

               Exams Labs
                  II   II
Student Course
Ada     Math      73   74
Quinn   Math      76   77
Violet  Math      79   80

In [166]:
#Sorting

#Sort by specific column or an ordered list of columns, with a MultiIndex
df.sort_values(by=("Labs", "II"), ascending=False)

               Exams     Labs
                   I  II    I  II
Student Course
Violet  Sci       78  81   81  81
        Math      77  79   81  80
        Comp      76  77   78  79
Quinn   Sci       75  78   78  78
        Math      74  76   78  77
        Comp      73  74   75  76
Ada     Sci       72  75   75  75
        Math      71  73   75  74
        Comp      70  71   72  73

In [171]:
df.sort_index(level='Student')

               Exams     Labs
                   I  II    I  II
Student Course
Ada     Comp      70  71   72  73
        Math      71  73   75  74
        Sci       72  75   75  75
Quinn   Comp      73  74   75  76
        Math      74  76   78  77
        Sci       75  78   78  78
Violet  Comp      76  77   78  79
        Math      77  79   81  80
        Sci       78  81   81  81

In [179]:
df.sort_index(level=['Student', 'Course'])

               Exams     Labs
                   I  II    I  II
Student Course
Ada     Comp      70  71   72  73
        Math      71  73   75  74
        Sci       72  75   75  75
Quinn   Comp      73  74   75  76
        Math      74  76   78  77
        Sci       75  78   78  78
Violet  Comp      76  77   78  79
        Math      77  79   81  80
        Sci       78  81   81  81

In [184]:
# Sorting rows by index (Student and Course):
# Sort by Student name
df_sorted_students = df.sort_index(level='Student')

# Sort by Student name, then Course
df_sorted_students_courses1 = df.sort_index(level=['Student', 'Course'])

# Sort by Student name, then Course
df_sorted_students_courses2 = df.sort_index(level=['Course', 'Student'])

In [185]:
df_sorted_students

               Exams     Labs
                   I  II    I  II
Student Course
Ada     Comp      70  71   72  73
        Math      71  73   75  74
        Sci       72  75   75  75
Quinn   Comp      73  74   75  76
        Math      74  76   78  77
        Sci       75  78   78  78
Violet  Comp      76  77   78  79
        Math      77  79   81  80
        Sci       78  81   81  81

In [186]:
df_sorted_students_courses1

               Exams     Labs
                   I  II    I  II
Student Course
Ada     Comp      70  71   72  73
        Math      71  73   75  74
        Sci       72  75   75  75
Quinn   Comp      73  74   75  76
        Math      74  76   78  77
        Sci       75  78   78  78
Violet  Comp      76  77   78  79
        Math      77  79   81  80
        Sci       78  81   81  81

In [187]:
df_sorted_students_courses2

               Exams     Labs
                   I  II    I  II
Student Course
Ada     Comp      70  71   72  73
Quinn   Comp      73  74   75  76
Violet  Comp      76  77   78  79
Ada     Math      71  73   75  74
Quinn   Math      74  76   78  77
Violet  Math      77  79   81  80
Ada     Sci       72  75   75  75
Quinn   Sci       75  78   78  78
Violet  Sci       78  81   81  81

In [189]:
# Sort rows by Exams I scores
df_sorted_exams_i = df.sort_values(by=('Exams', 'I'), ascending=False)

# Sort rows first by Exams I, then by Labs II
df_sorted_exams_labs = df.sort_values(by=[('Exams', 'I'), ('Labs', 'II')], ascending=[False, True])

In [190]:
df_sorted_exams_i

               Exams     Labs
                   I  II    I  II
Student Course
Violet  Sci       78  81   81  81
        Math      77  79   81  80
        Comp      76  77   78  79
Quinn   Sci       75  78   78  78
        Math      74  76   78  77
        Comp      73  74   75  76
Ada     Sci       72  75   75  75
        Math      71  73   75  74
        Comp      70  71   72  73

In [191]:
df_sorted_exams_labs

               Exams     Labs
                   I  II    I  II
Student Course
Violet  Sci       78  81   81  81
        Math      77  79   81  80
        Comp      76  77   78  79
Quinn   Sci       75  78   78  78
        Math      74  76   78  77
        Comp      73  74   75  76
Ada     Sci       72  75   75  75
        Math      71  73   75  74
        Comp      70  71   72  73

In [192]:
# Sort columns alphabetically
df_sorted_cols = df.sort_index(axis=1)
df_sorted_cols

               Exams     Labs
                   I  II    I  II
Student Course
Ada     Comp      70  71   72  73
        Math      71  73   75  74
        Sci       72  75   75  75
Quinn   Comp      73  74   75  76
        Math      74  76   78  77
        Sci       75  78   78  78
Violet  Comp      76  77   78  79
        Math      77  79   81  80
        Sci       78  81   81  81

In [194]:
# Sort columns by level, first 'Exams'/'Labs', then 'I'/'II'
df_sorted_cols_levels = df.sort_index(axis=1, level=[1, 0])
df_sorted_cols_levels

               Exams Labs Exams Labs
                   I    I    II   II
Student Course
Ada     Comp      70   72    71   73
        Math      71   75    73   74
        Sci       72   75    75   75
Quinn   Comp      73   75    74   76
        Math      74   78    76   77
        Sci       75   78    78   78
Violet  Comp      76   78    77   79
        Math      77   81    79   80
        Sci       78   81    81   81

In [195]:
# Sort columns based on Ada's scores
df_sorted_cols_ada = df.sort_values(by=('Ada', 'Comp'), axis=1, ascending=False)

# Sort columns first by Ada's Comp scores, then by Violet's Math scores
df_sorted_cols_complex = df.sort_values(by=[('Ada', 'Comp'), ('Violet', 'Math')], axis=1, ascending=[False, True])

In [196]:
df_sorted_cols_ada

               Labs     Exams
                 II   I    II   I
Student Course
Ada     Comp     73  72    71  70
        Math     74  75    73  71
        Sci      75  75    75  72
Quinn   Comp     76  75    74  73
        Math     77  78    76  74
        Sci      78  78    78  75
Violet  Comp     79  78    77  76
        Math     80  81    79  77
        Sci      81  81    81  78

In [197]:
df_sorted_cols_complex

               Labs     Exams
                 II   I    II   I
Student Course
Ada     Comp     73  72    71  70
        Math     74  75    73  71
        Sci      75  75    75  72
Quinn   Comp     76  75    74  73
        Math     77  78    76  74
        Sci      78  78    78  75
Violet  Comp     79  78    77  76
        Math     80  81    79  77
        Sci      81  81    81  78

In [198]:
df.sort_values(by=("Labs", "II"), ascending=False)

               Exams     Labs
                   I  II    I  II
Student Course
Violet  Sci       78  81   81  81
        Math      77  79   81  80
        Comp      76  77   78  79
Quinn   Sci       75  78   78  78
        Math      74  76   78  77
        Comp      73  74   75  76
Ada     Sci       72  75   75  75
        Math      71  73   75  74
        Comp      70  71   72  73

In [200]:
#missing data
df = pd.DataFrame(

    np.random.randn(6, 1),

    index=pd.date_range("2013-08-01", periods=6, freq="B"),

    columns=list("A"),

)

df

                   A
2013-08-01 -1.629793
2013-08-02  1.018794
2013-08-05  0.237759
2013-08-06  2.180038
2013-08-07  0.928464
2013-08-08 -0.148915

In [201]:
df.loc[df.index[3], "A"] = np.nan
df

                   A
2013-08-01 -1.629793
2013-08-02  1.018794
2013-08-05  0.237759
2013-08-06       NaN
2013-08-07  0.928464
2013-08-08 -0.148915

In [202]:
df.bfill()

                   A
2013-08-01 -1.629793
2013-08-02  1.018794
2013-08-05  0.237759
2013-08-06  0.928464
2013-08-07  0.928464
2013-08-08 -0.148915

In [203]:
#Grouping
df = pd.DataFrame(

    {

        "animal": "cat dog cat fish dog cat cat".split(),

        "size": list("SSMMMLL"),

        "weight": [8, 10, 11, 1, 20, 12, 12],

        "adult": [False] * 5 + [True] * 2,

    }

)


df

  animal size  weight  adult
0    cat    S       8  False
1    dog    S      10  False
2    cat    M      11  False
3   fish    M       1  False
4    dog    M      20  False
5    cat    L      12   True
6    cat    L      12   True

In [205]:
# List the size of the animals with the highest weight.

df.groupby("animal").apply(lambda subf: subf["size"][subf["weight"].idxmax()], include_groups=False)

animal
cat     L
dog     M
fish    M
dtype: object

In [206]:
gb = df.groupby("animal")

gb.get_group("cat")

  animal size  weight  adult
0    cat    S       8  False
2    cat    M      11  False
5    cat    L      12   True
6    cat    L      12   True

In [207]:
def GrowUp(x):

    avg_weight = sum(x[x["size"] == "S"].weight * 1.5)

    avg_weight += sum(x[x["size"] == "M"].weight * 1.25)

    avg_weight += sum(x[x["size"] == "L"].weight)

    avg_weight /= len(x)

    return pd.Series(["L", avg_weight, True], index=["size", "weight", "adult"])



expected_df = gb.apply(GrowUp, include_groups=False)

expected_df

       size   weight  adult
animal
cat       L  12.4375   True
dog       L  20.0000   True
fish      L   1.2500   True

In [210]:
import functools
S = pd.Series([i / 100.0 for i in range(1, 11)])

def cum_ret(x, y):

    return x * (1 + y)



def red(x):

    return functools.reduce(cum_ret, x, 1.0)

In [211]:
S

0    0.01
1    0.02
2    0.03
3    0.04
4    0.05
5    0.06
6    0.07
7    0.08
8    0.09
9    0.10
dtype: float64

In [212]:
S.expanding()

Expanding [min_periods=1,axis=0,method=single]

In [215]:
'''
[1, 0.01]
cum_ret(1, 0.01)
1.01
[1, 0.01, 0.02]
cum_ret(1, 0.01)
cum_ret(cum_ret(1,0.01), 0.02)
1.0302
'''
S.expanding().apply(red, raw=True)

0    1.010000
1    1.030200
2    1.061106
3    1.103550
4    1.158728
5    1.228251
6    1.314229
7    1.419367
8    1.547110
9    1.701821
dtype: float64

In [216]:
df = pd.DataFrame({"A": [1, 1, 2, 2], "B": [1, -1, 1, 2]})
df

   A  B
0  1  1
1  1 -1
2  2  1
3  2  2

In [217]:
gb = df.groupby("A")

In [218]:
def replace(g):

    mask = g < 0

    return g.where(~mask, g[~mask].mean())



gb.transform(replace)

   B
0  1
1  1
2  1
3  2

In [219]:
df = pd.DataFrame(

    {

        "code": ["foo", "bar", "baz"] * 2,

        "data": [0.16, -0.21, 0.33, 0.45, -0.59, 0.62],

        "flag": [False, True] * 3,

    }

)

df

  code  data   flag
0  foo  0.16  False
1  bar -0.21   True
2  baz  0.33  False
3  foo  0.45   True
4  bar -0.59  False
5  baz  0.62   True

In [220]:
code_groups = df.groupby("code")

agg_n_sort_order = code_groups[["data"]].transform("sum").sort_values(by="data")
agg_n_sort_order

   data
1 -0.80
4 -0.80
0  0.61
3  0.61
2  0.95
5  0.95

In [221]:
sorted_df = df.loc[agg_n_sort_order.index]

sorted_df

  code  data   flag
1  bar -0.21   True
4  bar -0.59  False
0  foo  0.16  False
3  foo  0.45   True
2  baz  0.33  False
5  baz  0.62   True

In [222]:
rng = pd.date_range(start="2014-10-07", periods=10, freq="2min")
rng

DatetimeIndex(['2014-10-07 00:00:00', '2014-10-07 00:02:00',
               '2014-10-07 00:04:00', '2014-10-07 00:06:00',
               '2014-10-07 00:08:00', '2014-10-07 00:10:00',
               '2014-10-07 00:12:00', '2014-10-07 00:14:00',
               '2014-10-07 00:16:00', '2014-10-07 00:18:00'],
              dtype='datetime64[ns]', freq='2min')

In [223]:
ts = pd.Series(data=list(range(10)), index=rng)
ts

2014-10-07 00:00:00    0
2014-10-07 00:02:00    1
2014-10-07 00:04:00    2
2014-10-07 00:06:00    3
2014-10-07 00:08:00    4
2014-10-07 00:10:00    5
2014-10-07 00:12:00    6
2014-10-07 00:14:00    7
2014-10-07 00:16:00    8
2014-10-07 00:18:00    9
Freq: 2min, dtype: int64

In [224]:
ts.resample("5min")

In [228]:
ts.resample("5min").apply(list).to_frame(name='Values')

                        Values
2014-10-07 00:00:00  [0, 1, 2]
2014-10-07 00:05:00     [3, 4]
2014-10-07 00:10:00  [5, 6, 7]
2014-10-07 00:15:00     [8, 9]

In [229]:
def MyCust(x):

    if len(x) > 2:

        return x.iloc[1] * 1.234

    return pd.NaT



mhc = {"Mean": "mean", "Max": "max", "Custom": MyCust}

ts.resample("5min").apply(mhc)

                     Mean  Max Custom
2014-10-07 00:00:00   1.0    2  1.234
2014-10-07 00:05:00   3.5    4    NaT
2014-10-07 00:10:00   6.0    7  7.404
2014-10-07 00:15:00   8.5    9    NaT

In [236]:
#Create a value counts column and reassign back to the DataFrame
df = pd.DataFrame(

    {"Color": "Red Red Red Blue".split(), "Value": [100, 150, 50, 50]}

)
df

  Color  Value
0   Red    100
1   Red    150
2   Red     50
3  Blue     50

In [237]:
df["Counts"] = df.groupby(["Color"]).transform(len)
df

  Color  Value  Counts
0   Red    100       3
1   Red    150       3
2   Red     50       3
3  Blue     50       1

In [239]:
#Shift groups of the values in a column based on the index
df = pd.DataFrame(

    {"line_race": [10, 10, 8, 10, 10, 8], "beyer": [99, 102, 103, 103, 88, 100]},

    index=[

        "Last Gunfighter",

        "Last Gunfighter",

        "Last Gunfighter",

        "Paynter",

        "Paynter",

        "Paynter",

    ],

)
df

                 line_race  beyer
Last Gunfighter         10     99
Last Gunfighter         10    102
Last Gunfighter          8    103
Paynter                 10    103
Paynter                 10     88
Paynter                  8    100

In [242]:
df["beyer_shifted"] = df.groupby(level=0)["beyer"].shift(1)
df

                 line_race  beyer  beyer_shifted
Last Gunfighter         10     99            NaN
Last Gunfighter         10    102           99.0
Last Gunfighter          8    103          102.0
Paynter                 10    103            NaN
Paynter                 10     88          103.0
Paynter                  8    100           88.0

In [243]:
#Select row with maximum value from each group
df = pd.DataFrame(

    {

        "host": ["other", "other", "that", "this", "this"],

        "service": ["mail", "web", "mail", "mail", "web"],

        "no": [1, 2, 1, 2, 1],

    }

).set_index(["host", "service"])
df

               no
host  service
other mail      1
      web       2
that  mail      1
this  mail      2
      web       1

In [244]:
mask = df.groupby(level=0).agg("idxmax")
mask

                 no
host
other  (other, web)
that   (that, mail)
this   (this, mail)

In [246]:
df.loc[mask["no"]]

               no
host  service
other web       2
that  mail      1
this  mail      2

In [249]:
df_count = df.loc[mask["no"]].reset_index()
df_count

    host service  no
0  other     web   2
1   that    mail   1
2   this    mail   2

In [250]:
#Grouping like Pythons itertools.
df = pd.DataFrame([0, 1, 0, 1, 1, 1, 0, 1, 1], columns=["A"])
df

   A
0  0
1  1
2  0
3  1
4  1
5  1
6  0
7  1
8  1

In [252]:
(df["A"] != df["A"].shift())

0     True
1     True
2     True
3     True
4    False
5    False
6     True
7     True
8    False
Name: A, dtype: bool

In [253]:
(df["A"] != df["A"].shift()).cumsum()

0    1
1    2
2    3
3    4
4    4
5    4
6    5
7    6
8    6
Name: A, dtype: int32

In [254]:
df["A"].groupby((df["A"] != df["A"].shift()).cumsum()).groups

{1: [0], 2: [1], 3: [2], 4: [3, 4, 5], 5: [6], 6: [7, 8]}

In [256]:
df

   A
0  0
1  1
2  0
3  1
4  1
5  1
6  0
7  1
8  1

In [255]:
df["A"].groupby((df["A"] != df["A"].shift()).cumsum()).cumsum()

0    0
1    1
2    0
3    1
4    2
5    3
6    0
7    1
8    2
Name: A, dtype: int64

In [284]:
#splitting
#Create a list of dataframes, split using a delineation based on logic included in rows.
df = pd.DataFrame(

    data={

        "Case": ["A", "A", "A", "B", "A", "A", "B", "A", "A"],

        "Data": np.random.randn(9),

    }

)
df

  Case      Data
0    A -0.605135
1    A -0.174150
2    A  0.649345
3    B -0.365896
4    A  1.364399
5    A  2.200943
6    B  0.084792
7    A  0.614399
8    A  1.008223

In [285]:
1 * (df["Case"] == "B")

0    0
1    0
2    0
3    1
4    0
5    0
6    1
7    0
8    0
Name: Case, dtype: int32

In [286]:
df.groupby((1 * (df["Case"] == "B"))).groups

{0: [0, 1, 2, 4, 5, 7, 8], 1: [3, 6]}

In [287]:
(1 * (df["Case"] == "B")).cumsum()

0    0
1    0
2    0
3    1
4    1
5    1
6    2
7    2
8    2
Name: Case, dtype: int32

In [288]:
df.groupby((1 * (df["Case"] == "B")).cumsum()).groups

{0: [0, 1, 2], 1: [3, 4, 5], 2: [6, 7, 8]}

In [289]:
rol = (1 * (df["Case"] == "B")).cumsum().rolling(window=3, min_periods=1)

In [290]:
[window.to_list() for window in rol]

[[0],
 [0, 0],
 [0, 0, 0],
 [0, 0, 1],
 [0, 1, 1],
 [1, 1, 1],
 [1, 1, 2],
 [1, 2, 2],
 [2, 2, 2]]

In [291]:
df.groupby((1 * (df["Case"] == "B")).cumsum().rolling(window=3, min_periods=1).median()).groups

{0.0: [0, 1, 2, 3], 1.0: [4, 5, 6], 2.0: [7, 8]}

In [283]:
list(zip(*df.groupby(

            (1 * (df["Case"] == "B"))

            .cumsum()

            .rolling(window=3, min_periods=1)

            .median()

        )))

[(0.0, 1.0, 2.0),
 (  Case      Data
  0    A -1.708627
  1    A  0.176433
  2    A  1.193053
  3    B -1.583934,
    Case      Data
  4    A  0.172914
  5    A  0.307268
  6    B  0.546273,
    Case      Data
  7    A  0.263116
  8    A -0.839800)]

In [292]:
dfs = list(

    zip(

        *df.groupby(

            (1 * (df["Case"] == "B"))

            .cumsum()

            .rolling(window=3, min_periods=1)

            .median()

        )

    )

)[-1]

In [293]:
dfs[0]

  Case      Data
0    A -0.605135
1    A -0.174150
2    A  0.649345
3    B -0.365896

In [294]:
dfs[1]

  Case      Data
4    A  1.364399
5    A  2.200943
6    B  0.084792

In [295]:
dfs[2]

  Case      Data
7    A  0.614399
8    A  1.008223

In [296]:
df = pd.DataFrame(

    data={

        "Province": ["ON", "QC", "BC", "AL", "AL", "MN", "ON"],

        "City": [

            "Toronto",

            "Montreal",

            "Vancouver",

            "Calgary",

            "Edmonton",

            "Winnipeg",

            "Windsor",

        ],

        "Sales": [13, 6, 16, 8, 4, 3, 1],

    }

)
df

  Province       City  Sales
0       ON    Toronto     13
1       QC   Montreal      6
2       BC  Vancouver     16
3       AL    Calgary      8
4       AL   Edmonton      4
5       MN   Winnipeg      3
6       ON    Windsor      1

In [298]:
table = pd.pivot_table(

    df,

    values=["Sales"],

    index=["Province"],

    columns=["City"],

    aggfunc="sum",

    margins=True,

)
table

           Sales
City     Calgary Edmonton Montreal Toronto Vancouver Windsor Winnipeg All
Province
AL           8.0      4.0      NaN     NaN       NaN     NaN      NaN  12
BC           NaN      NaN      NaN     NaN      16.0     NaN      NaN  16
MN           NaN      NaN      NaN     NaN       NaN     NaN      3.0   3
ON           NaN      NaN      NaN    13.0       NaN     1.0      NaN  14
QC           NaN      NaN      6.0     NaN       NaN     NaN      NaN   6
All          8.0      4.0      6.0    13.0      16.0     1.0      3.0  51

In [299]:
table.stack("City", future_stack=True)

                    Sales
Province City
AL       Calgary      8.0
         Edmonton     4.0
         Montreal     NaN
         Toronto      NaN
         Vancouver    NaN
         Windsor      NaN
         Winnipeg     NaN
         All         12.0
BC       Calgary      NaN
         Edmonton     NaN
         Montreal     NaN
         Toronto      NaN
         Vancouver   16.0
         Windsor      NaN
         Winnipeg     NaN
         All         16.0
MN       Calgary      NaN
         Edmonton     NaN
         Montreal     NaN
         Toronto      NaN
         Vancouver    NaN
         Windsor      NaN
         Winnipeg     3.0
         All          3.0
ON       Calgary      NaN
         Edmonton     NaN
         Montreal     NaN
         Toronto     13.0
         Vancouver    NaN
         Windsor      1.0
         Winnipeg     NaN
         All         14.0
QC       Calgary      NaN
         Edmonton     NaN
         Montreal     6.0
         Toronto      NaN
         Vancouver    NaN
         Windsor      NaN
         Winnipeg     NaN
         All          6.0
All      Calgary      8.0
         Edmonton     4.0
         Montreal     6.0
         Toronto     13.0
         Vancouver   16.0
         Windsor      1.0
         Winnipeg     3.0
         All         51.0

In [300]:
#Frequency table like plyr in R
grades = [48, 99, 75, 80, 42, 80, 72, 68, 36, 78]

In [306]:
df = pd.DataFrame(

    {

        "ID": ["x%d" % r for r in range(10)],

        "Gender": ["F", "M", "F", "M", "F", "M", "F", "M", "M", "M"],

        "ExamYear": [

            "2007",

            "2007",

            "2007",

            "2008",

            "2008",

            "2008",

            "2008",

            "2009",

            "2009",

            "2009",

        ],

        "Class": [

            "algebra",

            "stats",

            "bio",

            "algebra",

            "algebra",

            "stats",

            "stats",

            "algebra",

            "bio",

            "bio",

        ],

        "Participated": [

            "yes",

            "yes",

            "yes",

            "yes",

            "no",

            "yes",

            "yes",

            "yes",

            "yes",

            "yes",

        ],

        "Passed": ["yes" if x > 50 else "no" for x in grades],

        "Employed": [

            True,

            True,

            True,

            False,

            False,

            False,

            False,

            True,

            True,

            False,

        ],

        "Grade": grades,

    }

)

In [307]:
df

   ID Gender ExamYear    Class Participated Passed  Employed  Grade
0  x0      F     2007  algebra          yes     no      True     48
1  x1      M     2007    stats          yes    yes      True     99
2  x2      F     2007      bio          yes    yes      True     75
3  x3      M     2008  algebra          yes    yes     False     80
4  x4      F     2008  algebra           no     no     False     42
5  x5      M     2008    stats          yes    yes     False     80
6  x6      F     2008    stats          yes    yes     False     72
7  x7      M     2009  algebra          yes    yes      True     68
8  x8      M     2009      bio          yes     no      True     36
9  x9      M     2009      bio          yes    yes     False     78

In [309]:
df.groupby("ExamYear").agg(

    {

        "Participated": lambda x: x.value_counts()["yes"],

        "Passed": lambda x: sum(x == "yes"),

        "Employed": lambda x: sum(x),

        "Grade": lambda x: sum(x) / len(x),

    }

)

          Participated  Passed  Employed      Grade
ExamYear
2007                 3       2         3  74.000000
2008                 3       3         0  68.500000
2009                 3       2         2  60.666667

In [311]:
#To create year and month cross tabulation:
df = pd.DataFrame(

    {"value": np.random.randn(36)},

    index=pd.date_range("2011-01-01", freq="ME", periods=36),

)
df

               value
2011-01-31 -1.734771
2011-02-28  0.003409
2011-03-31  1.042131
2011-04-30 -1.597688
2011-05-31 -0.424235
2011-06-30 -0.686003
2011-07-31 -0.646912
2011-08-31 -0.048975
2011-09-30  0.405932
2011-10-31  0.952154
2011-11-30  0.707139
2011-12-31  0.805885
2012-01-31  0.959915
2012-02-29  0.278115
2012-03-31 -0.609343
2012-04-30  0.426943
2012-05-31 -1.309566
2012-06-30 -1.975181
2012-07-31  0.066887
2012-08-31 -0.143569
2012-09-30 -1.899560
2012-10-31 -0.947247
2012-11-30 -0.541408
2012-12-31 -0.761085
2013-01-31 -0.060309
2013-02-28  1.581432
2013-03-31 -0.874368
2013-04-30 -0.497829
2013-05-31 -0.586435
2013-06-30 -0.397033
2013-07-31 -0.285453
2013-08-31 -0.869890
2013-09-30  0.437118
2013-10-31  0.127779
2013-11-30 -0.169353
2013-12-31 -0.074125

In [316]:
pd.pivot_table(

    df, index=df.index.month, columns=df.index.year, values="value", aggfunc="sum"

)

        2011      2012      2013
1  -1.734771  0.959915 -0.060309
2   0.003409  0.278115  1.581432
3   1.042131 -0.609343 -0.874368
4  -1.597688  0.426943 -0.497829
5  -0.424235 -1.309566 -0.586435
6  -0.686003 -1.975181 -0.397033
7  -0.646912  0.066887 -0.285453
8  -0.048975 -0.143569 -0.869890
9   0.405932 -1.899560  0.437118
10  0.952154 -0.947247  0.127779
11  0.707139 -0.541408 -0.169353
12  0.805885 -0.761085 -0.074125

In [ ]:
#Apply